# Chapter 5 - Tabular data analysis with Pandas

## Popular movies

We will work with a dataset of popular movies: https://perso.telecom-paristech.fr/eagan/class/igr204/data/film.csv

Before you begin, run the code in this notebook to load the data and confirm that everything works. Go to the Cell menu, and press Run All.

In [1]:
# Let's first look at the data format:
# (BTW: "head" is a Linux/Mac command, on Windows you could look at the file with Notepad for example)
!head data/film.csv

Hmm ... there are a few issues:

- It's called a **comma** separated value (csv) file, but this one is separated with semicolons.
- Furthermore, the accents are wrong, they are probably encoded with latin1, which was used before UTF-8 became the default.
- The first row contains the headers, which we want to use as labels. However, the second row contains types, and we don't want that to end up in our dataframe, so we skip this row.
- The last column looks odd, Nicolas Cage was not in those movies. Let's drop it.

In [2]:
%matplotlib inline
import pandas as pd
import seaborn as sns
df = pd.read_csv('data/film.csv',
                 sep=';', encoding='latin1', skiprows=[1])
df = df.drop(['*Image'], axis=1)
df.head()

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards
0,1990,111.0,Tie Me Up! Tie Me Down!,Comedy,"Banderas, Antonio","Abril, Victoria","Almodóvar, Pedro",68.0,No
1,1991,113.0,High Heels,Comedy,"Bosé, Miguel","Abril, Victoria","Almodóvar, Pedro",68.0,No
2,1983,104.0,"Dead Zone, The",Horror,"Walken, Christopher","Adams, Brooke","Cronenberg, David",79.0,No
3,1979,122.0,Cuba,Action,"Connery, Sean","Adams, Brooke","Lester, Richard",6.0,No
4,1978,94.0,Days of Heaven,Drama,"Gere, Richard","Adams, Brooke","Malick, Terrence",14.0,No

In [3]:
df.shape

(1659, 9)

In [4]:
df.describe()

              Year       Length   Popularity
count  1659.000000  1592.000000  1653.000000
mean   1975.802893   105.179648    43.110103
std      17.057848    30.629501    26.747406
min    1920.000000     5.000000     0.000000
25%    1967.000000    90.000000    19.000000
50%    1983.000000   102.000000    43.000000
75%    1989.000000   116.000000    67.000000
max    1997.000000   450.000000    88.000000

# Questions

For each question below, fill in the code to compute the answer. Each cell contains a template with the expected variable name and code that produces a wrong answer, but with the right type and format.

In [5]:
# Example:
# 0. What is the most popular movie?
# Template:
example = df.head(1)
# Replace with your code:
example = df.nlargest(1, 'Popularity')

In [6]:
# To show the result:
example

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards
27,1980,NaN,Happy Birthday to Me,Horror,"Ford, Glenn","Anderson, Melissa Sue","Thompson, J. Lee",88.0,No

1. What is the longest movie? How long is it?

In [7]:
longestmovie = df.head(1)
# your code here

In [8]:
longestmovie

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards
0,1990,111.0,Tie Me Up! Tie Me Down!,Comedy,"Banderas, Antonio","Abril, Victoria","Almodóvar, Pedro",68.0,No

2. In which years did Sean Connery star in movies?

In [9]:
seanyears = df['Year']
# your code here

In [10]:
seanyears

0       1990
1       1991
2       1983
3       1979
4       1978
5       1983
6       1984
7       1989
8       1985
9       1990
10      1982
11      1982
12      1966
13      1986
14      1966
15      1985
16      1976
17      1929
18      1963
19      1988
20      1988
21      1981
22      1987
23      1991
24      1988
25      1990
26      1988
27      1980
28      1989
29      1979
        ...
1629    1934
1630    1932
1631    1932
1632    1965
1633    1991
1634    1992
1635    1991
1636    1939
1637    1939
1638    1938
1639    1990
1640    1991
1641    1991
1642    1992
1643    1991
1644    1991
1645    1934
1646    1992
1647    1993
1648    1991
1649    1991
1650    1993
1651    1992
1652    1991
1653    1990
1654    1932
1655    1989
1656    1988
1657    1977
1658    1991
Name: Year, Length: 1659, dtype: int64

3. What was the most popular movie in the 1950s? (from 1950 up to 1959, 1960 does not count)

In [11]:
mostpopular50s = df.head(1)
# your code here

In [12]:
mostpopular50s

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards
0,1990,111.0,Tie Me Up! Tie Me Down!,Comedy,"Banderas, Antonio","Abril, Victoria","Almodóvar, Pedro",68.0,No

4. What is the most popular movie with Nicolas Cage?

In [13]:
cage = df.head(1)
# your code here

In [14]:
cage

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards
0,1990,111.0,Tie Me Up! Tie Me Down!,Comedy,"Banderas, Antonio","Abril, Victoria","Almodóvar, Pedro",68.0,No

5. Give a list of actresses who starred in movies with Richard Gere

In [15]:
actresses = df['Actress']
# your code here

In [16]:
actresses

0              Abril, Victoria
1              Abril, Victoria
2                Adams, Brooke
3                Adams, Brooke
4                Adams, Brooke
5                  Adams, Maud
6                  Adams, Maud
7                 Adams, Trudy
8             Adjani, Isabelle
9             Adjani, Isabelle
10         Adolphson, Kristina
11                Aimee, Anouk
12                Aimee, Anouk
13                Aimee, Anouk
14                Aimee, Anouk
15             Aleandro, Norma
16           Alexander, Denise
17                Algood, Sara
18            Allen, Elizabeth
19                 Allen, Joan
20                Allen, Karen
21                Allen, Karen
22      Alonso, Maria Conchita
23      Alonso, Maria Conchita
24      Alonso, Maria Conchita
25             Anderson, Erika
26                Anderson, Jo
27       Anderson, Melissa Sue
28            Anderson, Melody
29             Andersson, Bibi
                 ...
1629                       NaN
1630                       NaN
1631                       NaN
1632                       NaN
1633                       NaN
1634                       NaN
1635                       NaN
1636                       NaN
1637                       NaN
1638                       NaN
1639                       NaN
1640                       NaN
1641                       NaN
1642                       NaN
1643                       NaN
1644                       NaN
1645                       NaN
1646                       NaN
1647                       NaN
1648                       NaN
1649                       NaN
1650                       NaN
1651                       NaN
1652                       NaN
1653                       NaN
1654                       NaN
1655                       NaN
1656                       NaN
1657                       NaN
1658                       NaN
Name: Actress, Length: 1659, dtype: object

6. Of the movies that won an award, what is the proportion of the genres ("Subject")? What is the most common genre among movies that did not win an award?

In [17]:
awardsprop = pd.Series({'Drama': 0.5, 'Comedy': 0.5}, name='Subject')
genre = pd.Series({'Horror': 55}, name='Subject')
# your code here

In [18]:
awardsprop

Drama     0.5
Comedy    0.5
Name: Subject, dtype: float64

In [19]:
genre

Horror    55
Name: Subject, dtype: int64

7. You are a new director and want to pick the genre that gives you the best chance for an award. Which genre has the highest proportion of awards? i.e., for each genre, compute awards_in_genre / total_in_genre

In [20]:
bestgenre = pd.Series({'Horror': 0.5}, name='Subject')
# your code here

In [21]:
bestgenre

Horror    0.5
Name: Subject, dtype: float64

8. Have movies become longer over time? Make a scatter plot with year on the x-axis and length on the y-axis. What is the correlation coefficient? Discuss whether you think there is a meaningful association.

In [22]:
# create scatter plot
# your code here

In [23]:
corr = 0.5
# your code here

In [24]:
corr

0.5

9. Think of an interesting question involving two or more variables and answer it with a table or plot.

In [25]:
# your code here

In [26]:
# your code here